a=int(input("Введите значение a:"))
b=int(input("Введите значение b:"))
if a>1000 | b>1000:
    print ('Error')
else:
    p = a ** 2 + b ** 2
    print (p)



#Дано два числа a и b. Найдите гипотенузу треугольника с заданными катетами.

#Входные данные
#В двух строках вводятся два числа (числа целые,положительные, не превышают 1000).

#Выходные данные
#Выведите ответ на задачу.